<!-- placeholder-1 -->
```fish
terraform plan -chdir=. -refresh=true
```
<!-- placeholder-2 -->

<!-- placeholder-3 -->
<details><summary>Plan: 2 to add, 0 to change, 2 to destroy.</br>

<!-- placeholder-4 -->
###### By @b- at 2025-08-11T00:30:02Z [(view log)](https://github.com/perchnet/p/actions/runs/16868154197/job/47778075377#step:11:1).
</summary>

```hcl

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 45, in resource "proxmox_virtual_environment_vm" "vm_template":
  45:     meta_data_file_id = coalesce(
  46:       var.ci_meta_data,
  47:       try(module.cloud_init_files[0].meta_data_file_id, null)
  48:     )
    ├────────────────
    │ while calling coalesce(vals...)
    │ module.cloud_init_files is empty tuple
    │ var.ci_meta_data is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 50, in resource "proxmox_virtual_environment_vm" "vm_template":
  50:     network_data_file_id = coalesce(
  51:       var.ci_network_data,
  52:       try(module.cloud_init_files[0].network_data_file_id, null)
  53:     )
    ├────────────────
    │ while calling coalesce(vals...)
    │ module.cloud_init_files is empty tuple
    │ var.ci_network_data is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 54, in resource "proxmox_virtual_environment_vm" "vm_template":
  54:     user_data_file_id    = coalesce(
  55:       var.ci_user_data,
  56:       try(module.cloud_init_files[0].user_data_file_id, null)
  57:     )
    ├────────────────
    │ while calling coalesce(vals...)
    │ module.cloud_init_files is empty tuple
    │ var.ci_user_data is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/debian13/modules/vm-template/main.tf line 58, in resource "proxmox_virtual_environment_vm" "vm_template":
  58:     vendor_data_file_id  = coalesce(
  59:       var.ci_vendor_data,
  60:       try(module.cloud_init_files[0].vendor_data_file_id, null)
  61:     )
    ├────────────────
    │ while calling coalesce(vals...)
    │ module.cloud_init_files is empty tuple
    │ var.ci_vendor_data is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/ubuntu22/modules/vm-template/main.tf line 45, in resource "proxmox_virtual_environment_vm" "vm_template":
  45:     meta_data_file_id = coalesce(
  46:       var.ci_meta_data,
  47:       try(module.cloud_init_files[0].meta_data_file_id, null)
  48:     )
    ├────────────────
    │ while calling coalesce(vals...)
    │ module.cloud_init_files is empty tuple
    │ var.ci_meta_data is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/ubuntu22/modules/vm-template/main.tf line 50, in resource "proxmox_virtual_environment_vm" "vm_template":
  50:     network_data_file_id = coalesce(
  51:       var.ci_network_data,
  52:       try(module.cloud_init_files[0].network_data_file_id, null)
  53:     )
    ├────────────────
    │ while calling coalesce(vals...)
    │ module.cloud_init_files is empty tuple
    │ var.ci_network_data is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/ubuntu22/modules/vm-template/main.tf line 54, in resource "proxmox_virtual_environment_vm" "vm_template":
  54:     user_data_file_id    = coalesce(
  55:       var.ci_user_data,
  56:       try(module.cloud_init_files[0].user_data_file_id, null)
  57:     )
    ├────────────────
    │ while calling coalesce(vals...)
    │ module.cloud_init_files is empty tuple
    │ var.ci_user_data is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.

Error: Error in function call

  on .terraform/modules/ubuntu22/modules/vm-template/main.tf line 58, in resource "proxmox_virtual_environment_vm" "vm_template":
  58:     vendor_data_file_id  = coalesce(
  59:       var.ci_vendor_data,
  60:       try(module.cloud_init_files[0].vendor_data_file_id, null)
  61:     )
    ├────────────────
    │ while calling coalesce(vals...)
    │ module.cloud_init_files is empty tuple
    │ var.ci_vendor_data is null

Call to function "coalesce" failed: no non-null, non-empty-string arguments.
onment_file" "ci_user_data_file" {
      - content_type   = "snippets" -> null
      - datastore_id   = "snippets" -> null
      - file_name      = "g6IilJ.user-data.yaml" -> null
      - id             = "snippets:snippets/g6IilJ.user-data.yaml" -> null
      - node_name      = "pve1" -> null
      - overwrite      = true -> null
      - timeout_upload = 1800 -> null

      - source_raw {
          - data      = (sensitive value) -> null
          - file_name = (sensitive value) -> null
          - resize    = 0 -> null
        }
    }

  # module.vm_minimal_config.module.cloud_init_files[0].proxmox_virtual_environment_file.ci_user_data[0] will be created
  + resource "proxmox_virtual_environment_file" "ci_user_data" {
      + content_type           = "snippets"
      + datastore_id           = "snippets"
      + file_modification_date = (known after apply)
      + file_name              = (known after apply)
      + file_size              = (known after apply)
      + file_tag               = (known after apply)
      + id                     = (known after apply)
      + node_name              = "pve1"
      + overwrite              = true
      + timeout_upload         = 1800

      + source_raw {
          + data      = (known after apply)
          + file_name = (known after apply)
          + resize    = 0
        }
    }

Plan: 2 to add, 0 to change, 2 to destroy.
```
</details>
<!-- placeholder-5 -->
<!-- terraform-43-3eee8c84341b95e00d4d4dd1307a8268.tfplan -->
<!-- placeholder-6 -->